VMs/Results/Baseline/Fio/results_3.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43798: Tue Dec 10 17:39:03 2024
  read: IOPS=1457, BW=5828KiB/s (5968kB/s)(1707MiB/300001msec)
    slat (usec): min=10, max=22247, avg=230.94, stdev=514.68
    clat (usec): min=3, max=12413, avg=366.10, stdev=524.12
     lat (usec): min=16, max=22330, avg=648.98, stdev=764.49
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   21], 40.00th=[  273], 50.00th=[  310], 60.00th=[  343],
     | 70.00th=[  388], 80.00th=[  482], 90.00th=[  709], 95.00th=[ 1037],
     | 99.00th=[ 2671], 99.50th=[ 3556], 99.90th=[ 5669], 99.95th=[ 6652],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 1868, max= 9488, per=24.70%, avg=5831.47, stdev=1130.25, samples=599
   iops        : min=  467, max= 2372, avg=1457.66, stdev=282.56, samples=599
  lat (usec)   : 4=0.07%, 10=20.51%, 20=9.26%, 50=2.13%, 100=0.79%
  lat (usec)   : 250=1.56%, 500=46.64%, 750=10.15%, 1000=3.66%
  lat (msec)   : 2=3.43%, 4=1.44%, 10=0.36%, 20=0.01%
  cpu          : usr=5.07%, sys=34.19%, ctx=498086, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=437113,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43799: Tue Dec 10 17:39:03 2024
  read: IOPS=1451, BW=5807KiB/s (5946kB/s)(1701MiB/300001msec)
    slat (usec): min=11, max=17209, avg=231.68, stdev=512.14
    clat (usec): min=3, max=15432, avg=369.26, stdev=524.86
     lat (usec): min=16, max=18506, avg=650.91, stdev=759.16
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   22], 40.00th=[  277], 50.00th=[  310], 60.00th=[  343],
     | 70.00th=[  392], 80.00th=[  490], 90.00th=[  717], 95.00th=[ 1037],
     | 99.00th=[ 2671], 99.50th=[ 3523], 99.90th=[ 5800], 99.95th=[ 6652],
     | 99.99th=[ 8848]
   bw (  KiB/s): min= 2147, max= 8896, per=24.60%, avg=5809.92, stdev=1121.75, samples=599
   iops        : min=  536, max= 2224, avg=1452.27, stdev=280.44, samples=599
  lat (usec)   : 4=0.05%, 10=20.17%, 20=9.29%, 50=1.97%, 100=0.78%
  lat (usec)   : 250=1.49%, 500=46.84%, 750=10.37%, 1000=3.79%
  lat (msec)   : 2=3.45%, 4=1.45%, 10=0.34%, 20=0.01%
  cpu          : usr=5.17%, sys=33.97%, ctx=495805, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=435513,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43800: Tue Dec 10 17:39:03 2024
  read: IOPS=1522, BW=6091KiB/s (6237kB/s)(1784MiB/300001msec)
    slat (usec): min=10, max=12120, avg=216.04, stdev=478.36
    clat (usec): min=3, max=13526, avg=353.26, stdev=497.45
     lat (usec): min=15, max=15889, avg=619.97, stdev=722.12
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   21], 40.00th=[  273], 50.00th=[  306], 60.00th=[  338],
     | 70.00th=[  383], 80.00th=[  461], 90.00th=[  668], 95.00th=[  963],
     | 99.00th=[ 2507], 99.50th=[ 3392], 99.90th=[ 5473], 99.95th=[ 6390],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 2624, max= 8736, per=25.83%, avg=6099.02, stdev=1113.76, samples=599
   iops        : min=  656, max= 2184, avg=1524.55, stdev=278.44, samples=599
  lat (usec)   : 4=0.03%, 10=20.43%, 20=9.41%, 50=1.94%, 100=0.81%
  lat (usec)   : 250=1.70%, 500=48.26%, 750=9.39%, 1000=3.32%
  lat (msec)   : 2=3.12%, 4=1.28%, 10=0.30%, 20=0.01%
  cpu          : usr=5.45%, sys=34.62%, ctx=506602, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=456826,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43801: Tue Dec 10 17:39:03 2024
  read: IOPS=1471, BW=5885KiB/s (6026kB/s)(1724MiB/300001msec)
    slat (usec): min=10, max=12829, avg=227.64, stdev=504.41
    clat (usec): min=3, max=13962, avg=362.67, stdev=514.91
     lat (usec): min=16, max=23183, avg=642.77, stdev=750.94
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   21], 40.00th=[  273], 50.00th=[  310], 60.00th=[  343],
     | 70.00th=[  388], 80.00th=[  482], 90.00th=[  693], 95.00th=[ 1004],
     | 99.00th=[ 2606], 99.50th=[ 3490], 99.90th=[ 5735], 99.95th=[ 6652],
     | 99.99th=[ 8848]
   bw (  KiB/s): min= 2868, max= 8312, per=24.95%, avg=5892.97, stdev=1035.08, samples=599
   iops        : min=  717, max= 2078, avg=1473.02, stdev=258.77, samples=599
  lat (usec)   : 4=0.03%, 10=19.92%, 20=10.03%, 50=1.82%, 100=0.77%
  lat (usec)   : 250=1.50%, 500=47.12%, 750=10.19%, 1000=3.63%
  lat (msec)   : 2=3.32%, 4=1.35%, 10=0.33%, 20=0.01%
  cpu          : usr=5.26%, sys=34.17%, ctx=498485, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=441366,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=23.1MiB/s (24.2MB/s), 5807KiB/s-6091KiB/s (5946kB/s-6237kB/s), io=6917MiB (7253MB), run=300001-300001msec

Disk stats (read/write):
  dm-0: ios=1469107/7, merge=0/0, ticks=338240/4, in_queue=338244, util=100.00%

Disk stats (read/write):
  sda: ios=1469171/6, merge=0/1, ticks=341771/3, in_queue=341776, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 17:39:03 2024
  read: IOPS=5902, BW=23.1Mi (24.2M)(6917MiB/300001msec)
    slat (usec): min=10, max=22247, avg=226.64, stdev=432.43
    clat (usec): min=3, max=15432, avg=363.49, stdev=444.65
     lat (usec): min=15, max=23183, avg=640.90, stdev=645.74
   bw (  KiB/s): min= 7639, max=25944, per=18.85%, avg=17801.91, stdev=1090.29, samples=1797
   iops        : min= 1909, max= 6486, avg=4449.84, stdev=272.57, samples=1797
  lat (usec)   : 4=0.05%, 10=20.26%, 20=9.50%, 50=1.96%, 100=0.79%
  lat (usec)   : 250=1.57%, 500=47.23%, 750=10.02%, 1000=3.60%
  lat (msec)   : 2=3.33%, 4=1.38%, 10=0.33%, 20=0.01%
  cpu          : usr=5.24%, sys=34.24%, ctx=1998978, majf=0, minf=59
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1770818,0,0,0 short=0,0,0,0 dropped=0,0,0,0